###############################################################
#  Generated by:      Cadence Innovus 21.37-s075_1
#  OS:                Linux x86_64(Host ID caen-vnc-mi04.engin.umich.edu)
#  Generated on:      Fri Feb 14 15:29:36 2025
#  Design:            xor_sbox
#  Command:           saveDesign xor_sbox.route_step8.enc
###############################################################
current_design xor_sbox
set_driving_cell -lib_cell INVX2TR -rise -min [get_ports {key[7]}]
set_driving_cell -lib_cell INVX2TR -fall -min [get_ports {key[7]}]
set_driving_cell -lib_cell INVX2TR -rise -max [get_ports {key[7]}]
set_driving_cell -lib_cell INVX2TR -fall -max [get_ports {key[7]}]
set_driving_cell -lib_cell INVX2TR -rise -min [get_ports {key[6]}]
set_driving_cell -lib_cell INVX2TR -fall -min [get_ports {key[6]}]
set_driving_cell -lib_cell INVX2TR -rise -max [get_ports {key[6]}]
set_driving_cell -lib_cell INVX2TR -fall -max [get_ports {key[6]}]
set_driving_cell -lib_cell INVX2TR -rise -min [get_ports {key[5]}]
set_driving_cell -lib_cell INVX2TR -fall -min [get_ports {key[5]}]
set_driving_cell -lib_cell INVX2TR -rise -max [get_ports {key[5]}]
set_driving_cell -lib_cell INVX2TR -fall -max [get_ports {key[5]}]
set_driving_cell -lib_cell INVX2TR -rise -min [get_ports {key[4]}]
set_driving_cell -lib_cell INVX2TR -fall -min [get_ports {key[4]}]
set_driving_cell -lib_cell INVX2TR -rise -max [get_ports {key[4]}]
set_driving_cell -lib_cell INVX2TR -fall -max [get_ports {key[4]}]
set_driving_cell -lib_cell INVX2TR -rise -min [get_ports {key[3]}]
set_driving_cell -lib_cell INVX2TR -fall -min [get_ports {key[3]}]
set_driving_cell -lib_cell INVX2TR -rise -max [get_ports {key[3]}]
set_driving_cell -lib_cell INVX2TR -fall -max [get_ports {key[3]}]
set_driving_cell -lib_cell INVX2TR -rise -min [get_ports {key[2]}]
set_driving_cell -lib_cell INVX2TR -fall -min [get_ports {key[2]}]
set_driving_cell -lib_cell INVX2TR -rise -max [get_ports {key[2]}]
set_driving_cell -lib_cell INVX2TR -fall -max [get_ports {key[2]}]
set_driving_cell -lib_cell INVX2TR -rise -min [get_ports {key[1]}]
set_driving_cell -lib_cell INVX2TR -fall -min [get_ports {key[1]}]
set_driving_cell -lib_cell INVX2TR -rise -max [get_ports {key[1]}]
set_driving_cell -lib_cell INVX2TR -fall -max [get_ports {key[1]}]
set_driving_cell -lib_cell INVX2TR -rise -min [get_ports {key[0]}]
set_driving_cell -lib_cell INVX2TR -fall -min [get_ports {key[0]}]
set_driving_cell -lib_cell INVX2TR -rise -max [get_ports {key[0]}]
set_driving_cell -lib_cell INVX2TR -fall -max [get_ports {key[0]}]
set_load -pin_load -max  0.01  [get_ports {out0[7]}]
set_load -pin_load -min  0.01  [get_ports {out0[7]}]
set_load -pin_load -max  0.01  [get_ports {out0[6]}]
set_load -pin_load -min  0.01  [get_ports {out0[6]}]
set_load -pin_load -max  0.01  [get_ports {out0[5]}]
set_load -pin_load -min  0.01  [get_ports {out0[5]}]
set_load -pin_load -max  0.01  [get_ports {out0[4]}]
set_load -pin_load -min  0.01  [get_ports {out0[4]}]
set_load -pin_load -max  0.01  [get_ports {out0[3]}]
set_load -pin_load -min  0.01  [get_ports {out0[3]}]
set_load -pin_load -max  0.01  [get_ports {out0[2]}]
set_load -pin_load -min  0.01  [get_ports {out0[2]}]
set_load -pin_load -max  0.01  [get_ports {out0[1]}]
set_load -pin_load -min  0.01  [get_ports {out0[1]}]
set_load -pin_load -max  0.01  [get_ports {out0[0]}]
set_load -pin_load -min  0.01  [get_ports {out0[0]}]
set_wire_load_model -library typical -max -name ibm13_wl10
set_wire_load_model -library typical -min -name ibm13_wl10
set_wire_load_mode enclosed
set_max_fanout 16  [get_designs {xor_sbox}]
